Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/boards.txt
SparkFun_ThingPlus-AWCU488.menu.UploadBaudrate.1500000=1500000
SparkFun_ThingPlus-AWCU488.menu.UploadBaudrate.1500000.upload.speed=1500000
SparkFun_ThingPlus-AWCU488.menu.UploadBaudrate.921600=921600
SparkFun_ThingPlus-AWCU488.menu.UploadBaudrate.921600.upload.speed=921600
##############################################################

Ameba_AMB25.name=AMB25 (RTL8720DF)
#Ameba_AMB25.vid.0=0x10C4
#Ameba_AMB25.pid.0=0xEA60

Ameba_AMB25.build.tarch=cortex-m33
Ameba_AMB25.build.mcu=RTL8720DF
Ameba_AMB25.build.f_cpu=200000000L
Ameba_AMB25.build.usb_product="AMB25"
Ameba_AMB25.build.board=AMEBA
Ameba_AMB25.build.core=ambd
Ameba_AMB25.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_AMB25 {build.usb_flags} -DArduino_STD_PRINTF
Ameba_AMB25.build.ldscript=linker_scripts/gcc/amebad_img2_is_arduino.ld
Ameba_AMB25.build.variant=ameba_amb25_amb26

Ameba_AMB25.upload.tool=ameba_d_tools
Ameba_AMB25.upload.protocol=usb_serial
Ameba_AMB25.upload.maximum_size=2097152
Ameba_AMB25.upload.use_1200bps_touch=false
Ameba_AMB25.upload.wait_for_upload_port=false
Ameba_AMB25.upload.native_usb=false
Ameba_AMB25.upload.auto_mode=Disable
Ameba_AMB25.upload.erase_flash=Disable
Ameba_AMB25.upload.speed=1500000

Ameba_AMB25.menu.EraseFlash.Disable=Disable
Ameba_AMB25.menu.EraseFlash.Disable.upload.erase_flash=Disable
Ameba_AMB25.menu.EraseFlash.Enable=Erase only
Ameba_AMB25.menu.EraseFlash.Enable.upload.erase_flash=Enable

Ameba_AMB25.menu.AutoUploadMode.Disable=Disable
Ameba_AMB25.menu.AutoUploadMode.Disable.upload.auto_mode=Disable
Ameba_AMB25.menu.AutoUploadMode.Enable=Enable
Ameba_AMB25.menu.AutoUploadMode.Enable.upload.auto_mode=Enable

Ameba_AMB25.menu.StdLibInit.Enable=Arduino_STD_PRINTF
Ameba_AMB25.menu.StdLibInit.Enable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_AMB25 {build.usb_flags} -DArduino_STD_PRINTF
Ameba_AMB25.menu.StdLibInit.Disable=Disable
Ameba_AMB25.menu.StdLibInit.Disable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_AMB25 {build.usb_flags}

Ameba_AMB25.menu.UploadBaudrate.1500000=1500000
Ameba_AMB25.menu.UploadBaudrate.1500000.upload.speed=1500000
Ameba_AMB25.menu.UploadBaudrate.921600=921600
Ameba_AMB25.menu.UploadBaudrate.921600.upload.speed=921600
##############################################################

Ameba_AMB26.name=AMB26 (RTL8720DF)
#Ameba_AMB26.vid.0=0x10C4
#Ameba_AMB26.pid.0=0xEA60

Ameba_AMB26.build.tarch=cortex-m33
Ameba_AMB26.build.mcu=RTL8720DF
Ameba_AMB26.build.f_cpu=200000000L
Ameba_AMB26.build.usb_product="AMB26"
Ameba_AMB26.build.board=AMEBA
Ameba_AMB26.build.core=ambd
Ameba_AMB26.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_AMB26 {build.usb_flags} -DArduino_STD_PRINTF
Ameba_AMB26.build.ldscript=linker_scripts/gcc/amebad_img2_is_arduino.ld
Ameba_AMB26.build.variant=ameba_amb25_amb26

Ameba_AMB26.upload.tool=ameba_d_tools
Ameba_AMB26.upload.protocol=usb_serial
Ameba_AMB26.upload.maximum_size=2097152
Ameba_AMB26.upload.use_1200bps_touch=false
Ameba_AMB26.upload.wait_for_upload_port=false
Ameba_AMB26.upload.native_usb=false
Ameba_AMB26.upload.auto_mode=Disable
Ameba_AMB26.upload.erase_flash=Disable
Ameba_AMB26.upload.speed=1500000

Ameba_AMB26.menu.EraseFlash.Disable=Disable
Ameba_AMB26.menu.EraseFlash.Disable.upload.erase_flash=Disable
Ameba_AMB26.menu.EraseFlash.Enable=Erase only
Ameba_AMB26.menu.EraseFlash.Enable.upload.erase_flash=Enable

Ameba_AMB26.menu.AutoUploadMode.Disable=Disable
Ameba_AMB26.menu.AutoUploadMode.Disable.upload.auto_mode=Disable
Ameba_AMB26.menu.AutoUploadMode.Enable=Enable
Ameba_AMB26.menu.AutoUploadMode.Enable.upload.auto_mode=Enable

Ameba_AMB26.menu.StdLibInit.Enable=Arduino_STD_PRINTF
Ameba_AMB26.menu.StdLibInit.Enable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_AMB26 {build.usb_flags} -DArduino_STD_PRINTF
Ameba_AMB26.menu.StdLibInit.Disable=Disable
Ameba_AMB26.menu.StdLibInit.Disable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_AMB26 {build.usb_flags}

Ameba_AMB26.menu.UploadBaudrate.1500000=1500000
Ameba_AMB26.menu.UploadBaudrate.1500000.upload.speed=1500000
Ameba_AMB26.menu.UploadBaudrate.921600=921600
Ameba_AMB26.menu.UploadBaudrate.921600.upload.speed=921600
##############################################################

u-blox_NORA-W30.name=u-blox NORA-W30 series (RTL8720DF)

u-blox_NORA-W30.build.tarch=cortex-m33
u-blox_NORA-W30.build.mcu=RTL8720DF
u-blox_NORA-W30.build.f_cpu=200000000L
u-blox_NORA-W30.build.usb_product="u-blox_NORA-W30"
u-blox_NORA-W30.build.board=AMEBA
u-blox_NORA-W30.build.core=ambd
u-blox_NORA-W30.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_UBLOX_NORAW30 {build.usb_flags} -DArduino_STD_PRINTF
u-blox_NORA-W30.build.ldscript=linker_scripts/gcc/amebad_img2_is_arduino.ld
u-blox_NORA-W30.build.variant=u-blox_nora-w30

u-blox_NORA-W30.upload.tool=ameba_d_tools
u-blox_NORA-W30.upload.protocol=usb_serial
u-blox_NORA-W30.upload.maximum_size=2097152
u-blox_NORA-W30.upload.use_1200bps_touch=false
u-blox_NORA-W30.upload.wait_for_upload_port=false
u-blox_NORA-W30.upload.native_usb=false
u-blox_NORA-W30.upload.auto_mode=Disable
u-blox_NORA-W30.upload.erase_flash=Disable
u-blox_NORA-W30.upload.speed=921600

u-blox_NORA-W30.menu.EraseFlash.Disable=Disable
u-blox_NORA-W30.menu.EraseFlash.Disable.upload.erase_flash=Disable
u-blox_NORA-W30.menu.EraseFlash.Enable=Erase only
u-blox_NORA-W30.menu.EraseFlash.Enable.upload.erase_flash=Enable

u-blox_NORA-W30.menu.AutoUploadMode.Disable=Disable
u-blox_NORA-W30.menu.AutoUploadMode.Disable.upload.auto_mode=Disable
u-blox_NORA-W30.menu.AutoUploadMode.Enable=Enable
u-blox_NORA-W30.menu.AutoUploadMode.Enable.upload.auto_mode=Enable

u-blox_NORA-W30.menu.StdLibInit.Enable=Arduino_STD_PRINTF
u-blox_NORA-W30.menu.StdLibInit.Enable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_UBLOX_NORAW30 {build.usb_flags} -DArduino_STD_PRINTF
u-blox_NORA-W30.menu.StdLibInit.Disable=Disable
u-blox_NORA-W30.menu.StdLibInit.Disable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_UBLOX_NORAW30 {build.usb_flags}
u-blox_NORA-W30.menu.StdLibInit.Enable=Arduino_STD_PRINTF
u-blox_NORA-W30.menu.StdLibInit.Enable.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_UBLOX_NORAW30 {build.usb_flags} -DArduino_STD_PRINTF

u-blox_NORA-W30.menu.UploadBaudrate.921600=921600
u-blox_NORA-W30.menu.UploadBaudrate.921600.upload.speed=921600
u-blox_NORA-W30.menu.UploadBaudrate.1500000=1500000
u-blox_NORA-W30.menu.UploadBaudrate.1500000.upload.speed=1500000
##############################################################

Sparkfun_ThingPlus-NORA-W306.name=SparkFun Thing Plus NORA-W306 (RTL8720DF)

Sparkfun_ThingPlus-NORA-W306.build.tarch=cortex-m33
Sparkfun_ThingPlus-NORA-W306.build.mcu=RTL8720DF
Sparkfun_ThingPlus-NORA-W306.build.f_cpu=200000000L
Sparkfun_ThingPlus-NORA-W306.build.usb_product="Sparkfun_ThingPlus-NORA-W306"
Sparkfun_ThingPlus-NORA-W306.build.board=SPARKFUN_THINGPLUS_NORAW306
Sparkfun_ThingPlus-NORA-W306.build.core=ambd
Sparkfun_ThingPlus-NORA-W306.build.extra_flags=-mthumb -DRTL8722DM -DBOARD_SPARKFUN_NORAW306 {build.usb_flags} -DArduino_STD_PRINTF
Sparkfun_ThingPlus-NORA-W306.build.ldscript=linker_scripts/gcc/amebad_img2_is_arduino.ld
Sparkfun_ThingPlus-NORA-W306.build.variant=sparkfun_thingplus-nora-w306

Sparkfun_ThingPlus-NORA-W306.upload.tool=ameba_d_tools
Sparkfun_ThingPlus-NORA-W306.upload.protocol=usb_serial
Sparkfun_ThingPlus-NORA-W306.upload.maximum_size=2097152
Sparkfun_ThingPlus-NORA-W306.upload.use_1200bps_touch=false
Sparkfun_ThingPlus-NORA-W306.upload.wait_for_upload_port=false
Sparkfun_ThingPlus-NORA-W306.upload.native_usb=false
Sparkfun_ThingPlus-NORA-W306.upload.auto_mode=Disable
Sparkfun_ThingPlus-NORA-W306.upload.erase_flash=Disable
Sparkfun_ThingPlus-NORA-W306.upload.speed=921600

Sparkfun_ThingPlus-NORA-W306.menu.EraseFlash.Disable=Disable
Sparkfun_ThingPlus-NORA-W306.menu.EraseFlash.Disable.upload.erase_flash=Disable
Sparkfun_ThingPlus-NORA-W306.menu.EraseFlash.Enable=Erase only
Sparkfun_ThingPlus-NORA-W306.menu.EraseFlash.Enable.upload.erase_flash=Enable

